package gonet

/*
+---------------------------------------------------+
+				     service						+
+---------------------------------------------------+
+		server			|		client				+
+---------------------------------------------------+
+		bee worker、conn pool、codec					+
+---------------------------------------------------+
+		transport(udp、tcp、ws、quic)			    +
+---------------------------------------------------+
*/

//一切皆服务
type IService interface {
	//服务名
	Name() string
	// 开启服务
	Start() error
	// 停止服务
	Stop() error
}
